In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\asus\anaconda3\lib\site-packages (1.2.4)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\asus\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\asus\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\asus\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\asus\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [6]:
import pandas as pd
pd.Series(['a','b','c'])

0    a
1    b
2    c
dtype: object

In [7]:
pd.DataFrame(((1,2,3),(4,5)))

   0  1    2
0  1  2  3.0
1  4  5  NaN

In [9]:
pd.DataFrame(((2,5,6),(5,8)),index=(1,2),columns=("a","h","c"))

   a  h    c
1  2  5  6.0
2  5  8  NaN

In [10]:
d1["name","year"]

NameError: name 'd1' is not defined

In [19]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[2,3],[4,5]])
df1 = pd.DataFrame({'jyo':[1,2,3,4],'janu':['a','b','c','d']})
df2 = pd.Series({'jyo':[1,2,3,4],'janu':['a','b','c','d']})
print(df)
print()
print(df1)
print()
print(df2)

   0  1
0  2  3
1  4  5

   jyo janu
0    1    a
1    2    b
2    3    c
3    4    d

jyo     [1, 2, 3, 4]
janu    [a, b, c, d]
dtype: object

In [22]:
df1.index = ['vzm','vskp','hyd','bang']
df1

      jyo janu
vzm     1    a
vskp    2    b
hyd     3    c
bang    4    d

In [26]:
df1.loc['vzm']

jyo     1
janu    a
Name: vzm, dtype: object

E

In [27]:
df1.iloc[0]

jyo     1
janu    a
Name: vzm, dtype: object

In [28]:
df1.iloc[0:]

      jyo janu
vzm     1    a
vskp    2    b
hyd     3    c
bang    4    d

In [29]:
df1.loc['hyd']

jyo     3
janu    c
Name: hyd, dtype: object

In [32]:
df1.iloc[2]

jyo     3
janu    c
Name: hyd, dtype: object

In [44]:
print(df1.iloc[1:2,1:])
print(df1.iloc[2:3,1:])

     janu
vskp    b
    janu
hyd    c

In [48]:
df1.iloc[1:4:2,1:]

     janu
vskp    b
bang    d